Autodesk.Revit.DB.RevisionSettings.SetAlphanumericRevisionSettings(Autodesk.Revit.DB.AlphanumericRevisionSettings)
Replaces the current alphanumeric revision numbering settings with the specified AlphanumericRevisionSettings.
newSettings:
The specified AlphanumericRevisionSettings to be applied to alphanumeric revision numbering.
Throws Autodesk.Revit.Exceptions.ArgumentException:
newSettings is not a valid AlphanumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.RevisionSettings.SetNumericRevisionSettings(Autodesk.Revit.DB.NumericRevisionSettings)
Replaces the current numeric revision numbering settings with the specified NumericRevisionSettings.
newSettings:
The specified NumericRevisionSettings to be applied to numeric revision numbering.
Throws Autodesk.Revit.Exceptions.ArgumentException:
newSettings is not a valid NumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016